app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)
		@article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Sample Article Title #6"], ["body", "This is the text for my sixth sample article! "], ["created_at", "2017-07-10 18:15:44.056770"], ["updated_at", "2017-07-10 18:15:44.056770"]]

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "beast.png"], ["image_updated_at", "2017-07-11 15:30:43.096354"], ["updated_at", "2017-07-11 15:30:43.607879"], ["id", 1]]

	def destroy
		flash.notice = "Article '#{Article.find(params[:id]).title}' Deleted!"
		Article.find(params[:id]).destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 7]]