app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "Dude"], ["body", "The man! "], ["article_id", 1], ["created_at", "2017-07-10 20:48:42.294225"], ["updated_at", "2017-07-10 20:48:42.294225"]]
---
	def create
		@comment = Comment.new(comment_params)
		@comment.article_id = params[:article_id]
		@comment.save