app/controllers/tags_controller.rb

	def show
		@tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def index
		@tags = Tag.all
---
SELECT "tags".* FROM "tags"

	def destroy
		Tag.find(params[:id]).destroy
---
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 2]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]